denote/20230909T204817--hyperline__hack.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-10-01 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>hyperline</title>
<meta name="generator" content="Org mode">
<meta name="author" content="root">
<link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel='stylesheet' href='https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css'><link rel='stylesheet' href='../css/site.css' /><link rel='stylesheet' href='../roam/css/code.css' /><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content">
<h1 class="title">hyperline</h1>

<div id="outline-container-org3d5b44e" class="outline-2">
<h2 id="org3d5b44e"><a href="#org3d5b44e">hyperline</a></h2>
<div class="outline-text-2" id="text-org3d5b44e">
</div>
<div id="outline-container-orgadf3d9f" class="outline-3">
<h3 id="orgadf3d9f"><a href="#orgadf3d9f">この文書のステータス</a></h3>
<div class="outline-text-3" id="text-orgadf3d9f">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> 作成中</li>
</ul>
</div>
</div>
<div id="outline-container-org7895e53" class="outline-3">
<h3 id="org7895e53"><a href="#org7895e53">概要</a></h3>
<div class="outline-text-3" id="text-org7895e53">
<p>
都市シミュレーションを作成する。
</p>
</div>
</div>
<div id="outline-container-org531122f" class="outline-3">
<h3 id="org531122f"><a href="#org531122f">導入</a></h3>
<div class="outline-text-3" id="text-org531122f">
<p>
都市と交通に着目したゲームを作る。
</p>
</div>
</div>
</div>
<div id="outline-container-org1768957" class="outline-2">
<h2 id="org1768957"><a href="#org1768957">Tasks</a></h2>
<div class="outline-text-2" id="text-org1768957">
</div>
<div id="outline-container-org34e7765" class="outline-3">
<h3 id="org34e7765"><a href="#org34e7765"><span class="todo TODO">TODO</span> ECSまわりのコードを読む</a></h3>
<div class="outline-text-3" id="text-org34e7765">
</div>
</div>
<div id="outline-container-orge7103bc" class="outline-3">
<h3 id="orge7103bc"><a href="#orge7103bc"><span class="todo TODO">TODO</span> タイル画像を直接触っている部分があり扱いにくい</a></h3>
<div class="outline-text-3" id="text-orge7103bc">
<p>
タイル画像が平原なら〜という箇所が大量に存在する。タイル画像ではなくオブジェクトで判定したいよな。
</p>

<ul class="org-ul">
<li>地形もオブジェクトとする(エンティティではない)</li>
<li>建物もエンティティとする
<ul class="org-ul">
<li>Renderコンポートネントを登録して描画する</li>
</ul></li>
<li>diggerではタイルは配列で表現されていた。2次元配列ではない。そうだ、タイルに関しては3次元でなくてよい。各座標に1つしかないのだから</li>
<li>タイルは配列にする</li>
<li>描画エンティティが座標と高さを持つようにする</li>
</ul>
</div>
</div>

<div id="outline-container-orgafe0f94" class="outline-3">
<h3 id="orgafe0f94"><a href="#orgafe0f94"><span class="todo TODO">TODO</span> マップと同じにできないのか</a></h3>
<div class="outline-text-3" id="text-orgafe0f94">
<p>
属性とマップの画像を別々に持っている。いちいちfor文で取り出している。そういうものな感じもする。
</p>
</div>
</div>
<div id="outline-container-org45484a8" class="outline-3">
<h3 id="org45484a8"><a href="#org45484a8"><span class="todo TODO">TODO</span> バス停を道路上だけに建設できるようにする</a></h3>
<div class="outline-text-3" id="text-org45484a8">
</div>
</div>
<div id="outline-container-org1472a5e" class="outline-3">
<h3 id="org1472a5e"><a href="#org1472a5e"><span class="todo TODO">TODO</span> 連続建設と単体建設を分ける</a></h3>
<div class="outline-text-3" id="text-org1472a5e">
<p>
道路系は範囲建設だが、建物系は単体建設になる。
</p>
</div>
</div>
<div id="outline-container-org571cf20" class="outline-3">
<h3 id="org571cf20"><a href="#org571cf20"><span class="todo TODO">TODO</span> バス停の詳細情報を見られるようにする</a></h3>
<div class="outline-text-3" id="text-org571cf20">
<p>
建設物の情報を保存する。
</p>
</div>
</div>
<div id="outline-container-orgedaf483" class="outline-3">
<h3 id="orgedaf483"><a href="#orgedaf483"><span class="todo TODO">TODO</span> 地形に付随したものをチェックできるようにする</a></h3>
<div class="outline-text-3" id="text-orgedaf483">
<p>
デバッグしやすくする。
</p>
</div>
</div>
<div id="outline-container-org1acbab9" class="outline-3">
<h3 id="org1acbab9"><a href="#org1acbab9"><span class="todo TODO">TODO</span> バス停に名前がつくようにする</a></h3>
<div class="outline-text-3" id="text-org1acbab9">
</div>
</div>

<div id="outline-container-orgb379957" class="outline-3">
<h3 id="orgb379957"><a href="#orgb379957"><span class="todo TODO">TODO</span> ebitenUIを使う</a></h3>
<div class="outline-text-3" id="text-orgb379957">
<p>
オレオレUIだからあまり綺麗じゃない。
</p>
</div>
</div>
<div id="outline-container-orgbbf1e41" class="outline-3">
<h3 id="orgbbf1e41"><a href="#orgbbf1e41"><span class="todo TODO">TODO</span> つながっているを表現する(平面)</a></h3>
<div class="outline-text-3" id="text-orgbbf1e41">
<ul class="org-ul">
<li>毎回道路に走るたびに乗り物に計算させてつながっているかは判定させればよさそう。つながっているかはベースの座標によって変わるので。</li>
<li>経路探索ライブラリがあるので、そんなに難しくない可能性がある</li>
</ul>
</div>
</div>
<div id="outline-container-org16dbdf9" class="outline-3">
<h3 id="org16dbdf9"><a href="#org16dbdf9"><span class="todo TODO">TODO</span> オブジェクトを道路上に走らせる</a></h3>
<div class="outline-text-3" id="text-org16dbdf9">
<p>
つながっている道路だけ走れる。
</p>
</div>
</div>
<div id="outline-container-orgb0932d2" class="outline-3">
<h3 id="orgb0932d2"><a href="#orgb0932d2"><span class="todo TODO">TODO</span> 高さについて考える</a></h3>
<div class="outline-text-3" id="text-orgb0932d2">
<p>
どうすればいいのか見当もつかない。
</p>
</div>
</div>
<div id="outline-container-org121a1e9" class="outline-3">
<h3 id="org121a1e9"><a href="#org121a1e9"><span class="todo TODO">TODO</span> つながっているを表現する(立体)</a></h3>
<div class="outline-text-3" id="text-org121a1e9">
<p>
異なる高さの道路は接続できない。スロープでしかつながらない。
</p>
</div>
</div>
<div id="outline-container-org3e1ccde" class="outline-3">
<h3 id="org3e1ccde"><a href="#org3e1ccde"><span class="todo TODO">TODO</span> 道路の方向を自動決定する</a></h3>
<div class="outline-text-3" id="text-org3e1ccde">
<p>
設置したときに周囲8マスの状態に応じて画像を変化させる。横にあれば曲がるアイコンになるだろう。
</p>
</div>
</div>
</div>
<div id="outline-container-orge2fcc70" class="outline-2">
<h2 id="orge2fcc70"><a href="#orge2fcc70">参考</a></h2>
<div class="outline-text-2" id="text-orge2fcc70">
<p>
参考になりそうなリンクを書いておく。
</p>

<p>
タイルマップパーサ。
<a href="https://github.com/lafriks/go-tiled">lafriks/go-tiled: Go library to parse Tiled map editor file format (TMX) and render map to image</a>
</p>

<p>
都市ゲーム。
<a href="https://code.rocket9labs.com/tslocum/citylimits">tslocum/citylimits: City-building simulation video game - citylimits - Rocket Nine Labs</a>
</p>

<p>
経路探索ライブラリ。
<a href="https://github.com/beefsack/go-astar">beefsack/go-astar: Go implementation of the A* search algorithm</a>
</p>
</div>
</div>
<div id="outline-container-orgadc8536" class="outline-2">
<h2 id="orgadc8536"><a href="#orgadc8536">Archives</a></h2>
<div class="outline-text-2" id="text-orgadc8536">
</div>
<div id="outline-container-orge094514" class="outline-3">
<h3 id="orge094514"><a href="#orge094514"><span class="done DONE">DONE</span> ベースを作る</a></h3>
<div class="outline-text-3" id="text-orge094514">
<p>
参考コードを元にする。不要そうなところを削除していく。
</p>

<ul class="org-ul">
<li class="on"><code>[X]</code> タイルセットを変えた</li>
</ul>
</div>
</div>
<div id="outline-container-org3ee871d" class="outline-3">
<h3 id="org3ee871d"><a href="#org3ee871d"><span class="done DONE">DONE</span> 道路画像を登録する</a></h3>
<div class="outline-text-3" id="text-org3ee871d">
<ul class="org-ul">
<li>後から追加する方法がわからない</li>
<li>描いたほうがはやそう
<ul class="org-ul">
<li>gimpで追加した</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org8da3620" class="outline-3">
<h3 id="org8da3620"><a href="#org8da3620"><span class="done DONE">DONE</span> ブルドーザーアイコンが消えた</a></h3>
<div class="outline-text-3" id="text-org8da3620">
<p>
タイルセットの更新を忘れていたっぽい。Tilesで保存し直したら差分が出て直った。
</p>
</div>
</div>
<div id="outline-container-org1d40b24" class="outline-3">
<h3 id="org1d40b24"><a href="#org1d40b24"><span class="done DONE">DONE</span> バス停を作る</a></h3>
<div class="outline-text-3" id="text-org1d40b24">
<p>
とりあえず画像は後回しにして、追加してみる。
</p>
</div>
</div>
<div id="outline-container-org54e9f2e" class="outline-3">
<h3 id="org54e9f2e"><a href="#org54e9f2e"><span class="done DONE">DONE</span> コード整理</a></h3>
<div class="outline-text-3" id="text-org54e9f2e">
<p>
全体ざっくり読んでみる。
</p>
</div>
</div>
<div id="outline-container-orgfdab2a0" class="outline-3">
<h3 id="orgfdab2a0"><a href="#orgfdab2a0"><span class="done DONE">DONE</span> 自動リリース</a></h3>
<div class="outline-text-3" id="text-orgfdab2a0">
<p>
設定する。
</p>
</div>
</div>
<div id="outline-container-org55c0c05" class="outline-3">
<h3 id="org55c0c05"><a href="#org55c0c05"><span class="done DONE">DONE</span> CIチェック</a></h3>
<div class="outline-text-3" id="text-org55c0c05">
<p>
ライブラリの依存関係が多いので、イメージを作成する。
</p>
</div>
</div>
<div id="outline-container-orgc926c3b" class="outline-3">
<h3 id="orgc926c3b"><a href="#orgc926c3b"><span class="done DONE">DONE</span> バス停の位置がずれている</a></h3>
<div class="outline-text-3" id="text-orgc926c3b">
<p>
設置時にカーソルとずれているのを直す。
</p>

<p>
建物は高さが違う。描画時に高く表示されていた。
</p>
</div>
</div>
<div id="outline-container-orgc7cfbc1" class="outline-3">
<h3 id="orgc7cfbc1"><a href="#orgc7cfbc1"><span class="done DONE">DONE</span> バス停を道路と重ねられるようにする</a></h3>
<div class="outline-text-3" id="text-orgc7cfbc1">
<p>
透過して重ねる。
</p>

<ul class="org-ul">
<li>TilesとTilesImage</li>
</ul>
</div>
</div>
<div id="outline-container-orga12a046" class="outline-3">
<h3 id="orga12a046"><a href="#orga12a046"><span class="done DONE">DONE</span> セルの大きさを統一する</a></h3>
<div class="outline-text-3" id="text-orga12a046">
<p>
今はスナップの精度が違うのでずれる。同じように建設してもずれる。
</p>

<ul class="org-ul">
<li>道路を4マスから1マスにした。自分で建てる建物は1マスでいいだろう。</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
